[
  {
      "title": "初心者向けプログラミング解説書",
      "star": 5,
      "userName": "kefian",
      "text": "「超」がつくほど丁寧な解説書です。特にプログラムの書き方や変数などの基礎知識から丁寧に説明されているので、プログラミング未経験でも安心して読めます。プログラミングは数学と似ていると言われることがありますが、この本を読むとその意味がよくわかります。そして、本当に基礎からわかりやすく書かれているので、これからプログラミングを始める人にはオススメできる一冊だと思います。※ただし、本書の内容は2020年時点のものです。"
  },
  {
      "title": "こんな本を待っていました！",
      "star": 5,
      "userName": "しろカブト",
      "text": "プログラマーとして就職し3年ほど経ちましたが、ずっと何か新しいプログラミング言語を覚えたいと思っており、この度この本を購入しました。本書ではC#を中心に様々な言語について紹介されていますが、どの言語についてもそれぞれの長所・短所をしっかりと書かれていてとても参考になりました。また、各言語のサンプルコードをたくさん読むことができて楽しかったです。ただ、残念なことに私自身はまだC#しか触ったことがないため、他の言語についてはこれから勉強していく予定です。しかし、今後C#以外の言語を覚える際には、本書を参考にしながら学習を進めていければいいなぁと考えています。"
  },
  {
      "title": "入門者にとって最高レベルの知識を得られる良書",
      "star": 4,
      "userName": "kirishun_0217",
      "text": "プログラミング初心者にとって最良の入門書であると断言できます。プログラミングとはどんなものか、そもそもなぜ必要なのか、というところから始まって、最終的には、Webサービスの開発方法まで詳しく書いてあります。さらに、例題が豊富で、実際に手を動かして試せるのもいいですね。しかも、内容が充実しているだけでなく、文章表現が非常にわかりやすいです。初心者がつまづきやすい部分をしっかりフォローしてくれる構成になっているので、初心者にも理解しやすいでしょう。"
  },
  {
      "title": "『Python3』を使いこなすためのバイブル",
      "star": 5,
      "userName": "こげにく",
      "text": "著者の方はエンジニアではなくビジネスマンであり、IT業界の知識はあまりないとのことですが、そんな方がここまで深い内容を書けることに驚きました。 内容的には、『はじめてのPython』『Python 3ガイドブック』の内容をひととおり網羅していて、その上で、より深く掘り下げた情報が記載されています。 また、日本語の解説本でありながら、英語の解説サイトをそのままコピペしているのではなく、きちんと日本語の文脈に合わせた形で編集されていて読みやすくなっています。 そのため、これからPythonを学ぶ上で役立つことは間違いありません。"
  },
  {
      "title": "プログラミングを学べる最高の教材",
      "star": 4,
      "userName": "kogetsu",
      "text": "「超」がつくほどの初心者向けの解説書です。内容は基礎的なことばかりですが、基礎だからこそ大切だということがよくわかると思います。たとえば、変数、配列、辞書といった概念の説明から始まり、関数やオブジェクト指向についてもしっかりと解説されています。プログラミングの基本的な考え方が自然と身につきますよ。また、本書の著者は現役のエンジニアではないものの、プログラマーになるために必要なことを丁寧に解説してくれているので、「プログラミングを学びたいけど、どうすればいいかわからない……」という人はぜひ読んでみてください。"
  },
  {
      "title": "わかりにくい",
      "star": 2,
      "userName": "kyou1_0805",
      "text": "プログラミングの基本用語などを紹介している章まではよかったのですが、それ以降になると専門用語が増えてきて難解になってきます。正直、私はそこまでコンピュータに詳しいわけではありませんし、ある程度予備知識がないとちんぷんかんぷんです。もし興味があるなら、以下の書籍を先に読むといいかもしれませんね。"
  },
  {
      "title": "普通に読める",
      "star": 3,
      "userName": "へーぼん",
      "text": "プログラミングに関する基礎的な部分だけを読みたいという人には良いと思います。 本書に書かれている内容はあくまで基本なので、詳しいことを知りたかったら別途他の本を読んでくださいということなのでしょうか？ まあ、そういう意味でも入門書なのでしょうが……。 あと、余談ですが、このレビューを書くにあたって調べたところ、本書は2016年出版のようです。 ということは、今から6年前ということになりますよね。 それなのに、未だに入門書レベルの内容しか載っていないというのは少し問題な気がします。 とはいえ、基礎が重要なのは確かですし、その点ではやはり良書と言えそうです。"
  },
  {
      "title": "基礎をしっかり押さえた上での応用",
      "star": 4,
      "userName": "mizukizaki",
      "text": "入門書というには少々分厚いですが、基礎を押さえるという意味では最適の一冊だと思います。本書に書かれていることは、すべて基礎中の基礎です。ですが、これくらいのことをちゃんと知っているかどうかがプログラミングでは重要だったりもするので、しっかり理解しておきましょう。本書では特に、C#（.NET）を使ってWebアプリを作る方法を詳細に紹介しています。C#自体は初心者でも簡単に使える言語ですし、この本を読むだけである程度の技術を身につけることができるでしょう。ただし、C#に慣れていない人がいきなり実践するのは厳しいですし、難易度の高いプログラムに挑戦しようとするのはやめておいたほうがいいです。まずは簡単なものから作っていき、徐々にステップアップしていくのが無難ですね。"
  },
  {
      "title": "「超」がつくほどわかりやすい",
      "star": 5,
      "userName": "narumiiiiin",
      "text": "本書ではC#を使ったプログラミング方法について詳しく解説されているのですが、とにかく内容がわかりやすくて助かりました。プログラミング未経験で、かつC#自体よくわかっていない私にとっては本当にありがたい一冊です。また、本書にはサンプルコードが豊富に掲載されているのも素晴らしいですね。初心者がつまづきやすいところやミスしやすい箇所などもフォローしてくれるので、初心者にも理解しやすくなっているはずです。"
  },
  {
      "title": "プログラミングの基本がわかる！",
      "star": 5,
      "userName": "nagaoka_saori",
      "text": "C#は初心者にとってハードルが高い言語ですが、本書はその壁を乗り越えるための手助けになります。 といっても、初心者向けと銘打っているので当然といえば当然な気はするのですが……笑 ただ、基礎的な内容ばかりではなく、ちょっとした応用テクニックまで紹介されているので、中級者にとっても十分役に立つでしょう。 初心者・中級者のどちらにもオススメできる一冊です。"
  },
  {
      "title": "こんなに詳しく書いて大丈夫なのか！？",
      "star": 4,
      "userName": "nobuyukisanozaki",
      "text": "本書はなんと、著者の方が現役エンジニアではないという衝撃的な事実が発覚しました。しかし、そんな事情を感じさせないクオリティの高さ。プログラミングの仕組みだけでなく、開発環境の構築方法、さらにはプログラミング言語の解説など、知りたいことをかなり網羅していると言ってもいい内容です。また、後半になるとプログラミング以外の話題にも触れており、ビジネスマンとしての経験を活かした考察力の高さも感じられます。初心者はもちろんのこと、プログラミングの仕組みを知り尽くした上でさらに深く学びたいと考えている上級者にこそ読んでほしい一冊です。"
  }
]